Ran Plan for 4 projects:

1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
1. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
1. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
1. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`

### 1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_autoscaler.asg[0] will be updated in-place
~ resource "google_compute_autoscaler" "asg" {
        creation_timestamp = "2020-09-22T18:41:02.792-07:00"
        id                 = "projects/2036174436/zones/us-west4-b/autoscalers/asg-amer-us-west4"
        name               = "asg-amer-us-west4"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b/autoscalers/asg-amer-us-west4"
      ~ target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b/instanceGroupManagers/asg-group-manager-amer-us-west4" -> "projects/2036174436/zones/us-west4-b/instanceGroupManagers/asg-group-manager-amer-us-west4"
        zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b"

      ~ autoscaling_policy {
            cooldown_period = 60
          ~ max_replicas    = 2 -> 3
            min_replicas    = 2
            mode            = "ON"

            cpu_utilization {
                target = 0.5
            }
        }
    }

  # google_compute_backend_service.asg[0] must be replaced
-/+ resource "google_compute_backend_service" "asg" {
      - affinity_cookie_ttl_sec         = 0 -> null
        connection_draining_timeout_sec = 300
      ~ creation_timestamp              = "2020-09-22T19:22:25.067-07:00" -> (known after apply)
      - custom_request_headers          = [] -> null
        enable_cdn                      = false
      ~ fingerprint                     = "x9sswluyA3Q=" -> (known after apply)
        health_checks                   = [
            "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-us-west4",
        ]
      ~ id                              = "projects/2036174436/global/backendServices/asg-backend-prod" -> (known after apply)
        load_balancing_scheme           = "EXTERNAL"
      ~ name                            = "asg-backend-prod" -> "asg-backend-amer-us-west4" # forces replacement
        port_name                       = "http"
      ~ project                         = "2036174436" -> (known after apply)
        protocol                        = "HTTP"
      ~ self_link                       = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/backendServices/asg-backend-prod" -> (known after apply)
      ~ session_affinity                = "NONE" -> (known after apply)
        timeout_sec                     = 10

      - backend {
          - balancing_mode               = "UTILIZATION" -> null
          - capacity_scaler              = 1 -> null
          - group                        = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b/instanceGroups/asg-group-manager-amer-us-west4" -> null
          - max_connections              = 0 -> null
          - max_connections_per_endpoint = 0 -> null
          - max_connections_per_instance = 0 -> null
          - max_rate                     = 0 -> null
          - max_rate_per_endpoint        = 0 -> null
          - max_rate_per_instance        = 0 -> null
          - max_utilization              = 0.8 -> null
        }
      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b/instanceGroups/asg-group-manager-amer-us-west4"
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 140, in resource "google_compute_backend_service" "asg":
 140:     group = "${google_compute_instance_group_manager.asg[count.index].instance_group}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_autoscale`
</details>

---
### 2. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # google_compute_autoscaler.asg[0] will be updated in-place
~ resource "google_compute_autoscaler" "asg" {
        creation_timestamp = "2020-09-22T18:41:53.740-07:00"
        id                 = "projects/2036174436/zones/asia-east2-b/autoscalers/asg-asia-asia-east2"
        name               = "asg-asia-asia-east2"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/asia-east2-b/autoscalers/asg-asia-asia-east2"
      ~ target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/asia-east2-b/instanceGroupManagers/asg-group-manager-asia-asia-east2" -> "projects/2036174436/zones/asia-east2-b/instanceGroupManagers/asg-group-manager-asia-asia-east2"
        zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/asia-east2-b"

      ~ autoscaling_policy {
            cooldown_period = 60
          ~ max_replicas    = 2 -> 3
            min_replicas    = 2
            mode            = "ON"

            cpu_utilization {
                target = 0.5
            }
        }
    }

  # google_compute_backend_service.asg[0] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = [
          + "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-asia-east2",
        ]
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "asg-backend-asia-asia-east2"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/asia-east2-b/instanceGroups/asg-group-manager-asia-asia-east2"
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 140, in resource "google_compute_backend_service" "asg":
 140:     group = "${google_compute_instance_group_manager.asg[count.index].instance_group}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_asia_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_asia_autoscale`
</details>

---
### 3. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # google_compute_autoscaler.asg[0] will be updated in-place
~ resource "google_compute_autoscaler" "asg" {
        creation_timestamp = "2020-09-22T18:43:33.439-07:00"
        id                 = "projects/2036174436/zones/australia-southeast1-b/autoscalers/asg-ocea-australia-southeast1"
        name               = "asg-ocea-australia-southeast1"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/australia-southeast1-b/autoscalers/asg-ocea-australia-southeast1"
      ~ target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/australia-southeast1-b/instanceGroupManagers/asg-group-manager-ocea-australia-southeast1" -> "projects/2036174436/zones/australia-southeast1-b/instanceGroupManagers/asg-group-manager-ocea-australia-southeast1"
        zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/australia-southeast1-b"

      ~ autoscaling_policy {
            cooldown_period = 60
          ~ max_replicas    = 2 -> 3
            min_replicas    = 2
            mode            = "ON"

            cpu_utilization {
                target = 0.5
            }
        }
    }

  # google_compute_backend_service.asg[0] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = [
          + "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-australia-southeast1",
        ]
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "asg-backend-ocea-australia-southeast1"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/australia-southeast1-b/instanceGroups/asg-group-manager-ocea-australia-southeast1"
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 140, in resource "google_compute_backend_service" "asg":
 140:     group = "${google_compute_instance_group_manager.asg[count.index].instance_group}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_ocea_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Focea)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_ocea_autoscale`
</details>

---
### 4. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # google_compute_autoscaler.asg[0] will be updated in-place
~ resource "google_compute_autoscaler" "asg" {
        creation_timestamp = "2020-09-22T18:42:43.794-07:00"
        id                 = "projects/2036174436/zones/europe-west6-a/autoscalers/asg-euro-europe-west6"
        name               = "asg-euro-europe-west6"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/autoscalers/asg-euro-europe-west6"
      ~ target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/instanceGroupManagers/asg-group-manager-euro-europe-west6" -> "projects/2036174436/zones/europe-west6-a/instanceGroupManagers/asg-group-manager-euro-europe-west6"
        zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a"

      ~ autoscaling_policy {
            cooldown_period = 60
          ~ max_replicas    = 2 -> 3
            min_replicas    = 2
            mode            = "ON"

            cpu_utilization {
                target = 0.5
            }
        }
    }

  # google_compute_backend_service.asg[0] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = [
          + "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-europe-west6",
        ]
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "asg-backend-euro-europe-west6"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/instanceGroups/asg-group-manager-euro-europe-west6"
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 140, in resource "google_compute_backend_service" "asg":
 140:     group = "${google_compute_instance_group_manager.asg[count.index].instance_group}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_euro_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Feuro)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_euro_autoscale`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
